const W: usize = 30; // Ширина конверта
const H: usize = 20; // Висота конверта

fn main() {
    // Верхня частина конверта
    for i in 0..W {
        if i == 0 || i == W - 1 {
            print!("+");
        } else {
            print!("-");
        }
    }
    println!(); // Перехід на новий рядок

    // Середина конверта
    for i in 1..H - 1 {
        print!("|"); // Ліва межа конверта
        for j in 1..W - 1 {
            print!(" ");
        }
        println!("|"); // Права межа конверта
    }

    // Нижня частина конверта
    for i in 0..W {
        if i == 0 || i == W - 1 {
            print!("+");
        } else {
            print!("-");
        }
    }
    println!(); // Перехід на новий рядок
}
